/**
 * Alipay.com Inc.
 * Copyright (c) 2004-2012 All Rights Reserved.
 */
package com.seu.yang11.common.util;

import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteDatabase.CursorFactory;
import android.database.sqlite.SQLiteOpenHelper;

import com.seu.yang11.common.dal.DBConfigs;

/**
 * sqlite数据库助手
 * 
 * @author cheng.dai@alipay.com
 * @version $Id: DataBaseOpenHelper.java, v 0.1 2012-4-25 下午9:07:54 narutoying Exp $
 */
public class DataBaseOpenHelper extends SQLiteOpenHelper {
	// 类没有实例化,是不能用作父类构造器的参数,必须声明为静态  
	private static String dbname = DBConfigs.QUESTIONAIRE_DB_NAME;
	private static int version = 1;

	public DataBaseOpenHelper(Context context) {
		// 第一个参数是应用的上下文  
		// 第二个参数是应用的数据库名字  
		// 第三个参数CursorFactory指定在执行查询时获得一个游标实例的工厂类,设置为null,代表使用系统默认的工厂类  
		// 第四个参数是数据库版本，必须是大于0的int（即非负数）  
		super(context, dbname, null, version);
	}

	public DataBaseOpenHelper(Context context, String name,
			CursorFactory factory, int version) {
		super(context, name, factory, version);
	}

	@Override
	public void onCreate(SQLiteDatabase db) {
		/**
		 * 这个方法是在第一次初始化数据库的时候调用的，起到创建4张表和初始化一些数据（主要就是问题模板）
		 * 一旦调用之后，就不会再调用这个方法了，因为每次程序访问数据库的时候都会使用这个类，这个类首先会去
		 * 查找 dbname = "DietaryExposureSystem.db"，是否已经存在这个db文件，如果不存在这个文件，
		 * 就会调用onCreate这个方法，所以调用一次后就有了db文件，就不会再初始化表和数据鸟~
		 */
//		initQuestionaireTemplate(db);
//		initQuestionaireInstance(db);
//		initQuestionTemplate(db);
//		initQuestionInstance(db);
	}

	private void initQuestionaireTemplate(SQLiteDatabase db) {
		db.execSQL(DBConfigs.CREATE_TABLE_QUESTIONAIRE_TEMPLATE);
		db.execSQL("insert into "
				+ DBConfigs.TABLE_QUESTIONAIRE_TEMPLATE
				+ " (id,name,description,questionsteps) values(1,'省疾控调查问卷','省疾控调查问卷','0:测试步骤0|1:测试步骤1|2:测试步骤2|3:测试步骤3|4:测试步骤4')");
	}

	private void initQuestionaireInstance(SQLiteDatabase db) {
		db.execSQL(DBConfigs.CREATE_TABLE_QUESTIONAIRE_INSTANCE);
	}

	private void initQuestionTemplate(SQLiteDatabase db) {
		db.execSQL(DBConfigs.CREATE_TABLE_QUESTION_TEMPLATE);
		// 初始化题目，先用代码的方式初始化。以后考虑是否做成可以通过文件导入题目的功能 TODO
		// 题目的字段依次为：
		// 问卷模板id(默认1)，问题内部序号(从1开始，每种类型的问题内部序号相互独立)，
		// 题干，题体，步骤(QuestionStep)，类型(QuestionType)
		String basicSql = "insert into "
				+ DBConfigs.TABLE_QUESTION_TEMPLATE
				+ " (questionaireTemplateId, qIndex, title, content, step, type)"; // validator
		//基本信息
		/*		db.execSQL(basicSql
						+ " values('1', '1', '您的性别?', '1@男|2@女', '0', '3');");
		db.execSQL(basicSql
				+ " values('1', '2', '您今年几周岁?$工作几年了?$', '', '0', '1', 'digit:0-100|digit:0-60');");
		// 测试使用
		db.execSQL(basicSql
				+ " values('1', '2', '今年几周岁?$工作几年?$', '', '1', '1', '');");
		db.execSQL(basicSql
				+ " values('1', '3', '您是哪个民族的？', '1@汉族|2@回族|3@满族|4@维吾尔族|5@蒙古族|6@其它', '0', '3');");
		db.execSQL(basicSql
				+ " values('1', '4', '您的现有文化程度如何？', '1@不识字或识字很少 |2@小学 |3@初中|4@高中/职高/中专|5@大专/本科|6@硕士及以上', '0', '3');");
		db.execSQL(basicSql
				+ " values('1', '5', '您现在的职业是什么？', '1@国家机关、党群组织负责人|2@企事业单位负责人 |3@专业技术人员|4@办事人员和有关人员|5@农、林、牧、渔、水利业生产人员|6@商业和服务业人员|7@生产及运输设备操作工人" +
				"|8@学生|9@失业人员及下岗人员|10@离退休人员 |11@农民工|12@其它', '0', '3');");
		db.execSQL(basicSql
				+ " values('1', '6', '您现在的婚姻状况是什么？', '1@未婚|2@已婚|3@丧偶|4@离异|5@其他', '0', '3');");
		db.execSQL(basicSql
				+ " values('1', '7', '您是否从事医疗卫生方面的工作', '1@是|2@否', '0', '3');");
		db.execSQL(basicSql + " values('1', '8', '您的家庭常住人口几人（指每年在家居住半年以上）$', '', '0', '1');");
		db.execSQL(basicSql
				+ " values('1', '9', '去年，您全家的平均月收入是多少？', '1@<500元|2@500～999元|3@1000～1999元|4@2000～4999元|5@5000～9999元|6@10000以上|6@不清楚', '0', '3');");
		
		
		//判断题部分
		db.execSQL(basicSql
				+ " values('1', '1', '每个人都应承担起维护自身和他人健康的责任。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '2', '健康是指无疾病、不虚弱的身体状况。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '3', '多饮、多食、多尿，伴有体重下降是癌症的早期报警信号。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '4', '坚持正规治疗，绝大部分肺结核病人能够治愈。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '5', '水果在营养成分和健康效应方面跟蔬菜有很多相似之处，所以水果可以代替蔬菜。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '6', '把好“病从口入”关，是预防甲肝、肥胖、糖尿病等疾病的最有效措施。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '7', '健康成人的正常血压为收缩压低于140毫米汞柱、舒张压低于90毫米汞柱。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '8', '保健品不能代替药品，但可以替代食品。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '9', '读书写字时，眼睛与书本最佳距离为40厘米。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '10', '偶尔吃点“摇头丸”等毒品不会成瘾，对身体也无害。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '11', '打针比吃药好得快，生病了就应该尽量打针。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '12', '吸烟者如果60岁以后才戒烟就晚了，对健康没有益处。', '1@是|0@否', '1', '2');");
		db.execSQL(basicSql
				+ " values('1', '13', '劳动者应该了解工作岗位存在的危害因素，遵守操作规程，注意个人防护，养成良好习惯。', '1@是|0@否', '1', '2');");
		
		*/
		//单选题
		db.execSQL(basicSql
				+ " values('1', '1', '健康的定义是指：', '1@身体没有病@3|2@不胖不瘦，身体强壮@4|3@能吃能睡无大病@5|4@身体健康，心理健康和良好的社会适应能力|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '2', '您认为消除室内空气污染最有效的方法是：', '1@经常开窗通风 |2@喷洒消毒剂|3@喷洒空气清新剂|4@以上都是|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '3', '补钙效果最好的食品是哪类食品？', '1@奶类|2@肉类|3@谷类|4@蔬菜|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '4', '我国成年人健康体重的体质指数（BMI）范围为？', '1@14.5～18.4千克/米2|2@18.5～23.9千克/米2|3@24～27.9千克/米2|4@28～32.9千克/米2|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '5', '正常成年人平静呼吸时，每分钟呼吸次数为：', '1@12-14次|2@14-16次|3@16-20次|4@20-22次|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '6', '儿童青少年必须养成良好的用眼习惯，连续读、写不宜超过多长时间？', '1@30分钟|2@50分钟|3@1小时|4@90分钟|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '7', '孕妇必须在怀孕多长时间内，开始进行孕期检查?', '1@3个月内|2@4个月内|3@5个月内|4@6个月内|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '8', '高盐饮食对健康造成哪些危害：', '1@易引起肠道传染病|2@易引起肝病|3@易引起高血压、心脏病、动脉硬化|4@以上都是|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '9', '经常过量饮酒有什么害处？', '1@引起酒精中毒|2@会增加患肝硬化、消化道癌症、高血压、中风等疾病的风险。|3@易导致意外伤害|4@以上都是|5@不知道','2','3');");
			/*	
		db.execSQL(basicSql
				+ " values('1', '10', '当你身边有人不小心摔断腿时，应如何处理：', '1@搀扶患者去医院|2@固定患肢，把患者抬到医院急救|3@让患者卧床休息|4@不知道如何处理 ', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '11', '与高血压的发病关系最密切的是？', '1@肥胖、吃盐过多、精神紧张等|2@贫血或血液浓度过高|3@营养不良|4@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '12', '肺结核病主要通过哪种途径传播？', '1@日常生活接触传播|2@咳嗽、打喷嚏等产生的飞沫传播|3@性接触传播|4@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '13', '目前预防甲型肝炎最有效的措施是', '1@加强粪便管理，做好餐具消毒，不吃不洁食品。|2@全民接种免疫球蛋白|3@阻断母婴传播|4@避免不安全性行为|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '14', '不随地吐痰是防止传播下面哪种疾病的有效措施？', '1@肿瘤|2@高血压|3@肺结核|4@糖尿病|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '15', '预防艾滋病的错误方法是：', '1@安全性行为：正确使用质量可靠的避孕套，洁身自爱；|2@远离毒品：不吸毒、尤其不与他人共用针具吸毒；|3@避免经血感染：提倡无偿献血，不输入被污染的血液；|4@远离艾滋病感染者和艾滋病患者，不与他们接触。', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '16', '您认为预防一些传染病（如：麻疹、乙肝等）最有效、最经济的措施是：', '1@加强营养|2@锻炼身体|3@母乳喂养|4@接种疫苗|5@注意个人卫生|6@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '17', '如果您的同学、同事或朋友得了肺结核你会怎样对待他？', '1@无所谓，正常与其交往|2@从此不再和他来往|3@只要经过一段时间的正规治疗后就可以像对待正常人一样|4@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '18', '您认为“适量无偿献血”是指每人每次献血多少毫升？', '1@小于200毫升|2@200～400毫升|3@大于400毫升|4@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '19', '以下关于抗生素的几种说法，您认为正确的是：', '1@感冒必须马上吃抗生素|2@抗生素可以根据病情，自行购买|3@抗生素应在医生指导下使用|4@抗生素既能杀灭细菌又能杀灭病毒|5@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '20', '您认为得血吸虫病是因为：', '1@吃不干净食物|2@喝生水|3@到有钉螺的地方下水或在水中游泳|4@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '21', '您认为下列说法正确的是：', '1@生、熟食品要分开存放和加工|2@切完蔬菜的刀，用水冲后可以切熟肉|3@切生肉的砧板，用水冲后可以切熟肉|4@不知道', '2', '3');");
		db.execSQL(basicSql
				+ " values('1', '22', '为了保证旺盛的精力，提高工作效率，以下不正确的是？', '1@养成良好的学习、工作、生活习惯；|2@经常参加文体活动；|3@睡眠越多越好；|4@劳逸结合。', '2', '3');");
		
		//多选题
		db.execSQL(basicSql
				+ " values('1', '1', '如何保持心理健康？', 'a@情绪稳定、生活态度乐观；|b@适应环境变化；|c@乐于工作，热爱生活；|d@正确处理人际关系；|e@朋友越多越好，常聚会喝酒；|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '2', '您认为健康的生活方式包括哪些内容：', 'a@戒烟、限酒|b@平衡膳食|c@心胸开阔|d@多吃保健品、营养品|e@控制体重|f@多吃多睡|g@经常运动|h@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '3', '对触电如何紧急处理？', 'a@切断电源；|b@用绝缘物挑开电线；|c@把触电者移到通风处急救；|d@用手推开触电人员；|e@用干燥的棍子拨离触电人员。|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '4', '您认为被动吸烟会引发下列哪些疾病?', 'a@肺癌|b@冠心病|c@慢性阻塞性肺病|d@龋齿|e@胃肠炎|f@白内障|g@阳痿|h@骨质疏松|i@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '5', '儿童计划免疫(预防注射)可预防哪些疾病？', 'a@百白破疫苗可预防：百日咳、白喉、破伤风；|b@卡介苗可预防结核病；|c@脊灰疫苗可预防小儿麻痹；|d@麻疹疫苗可预防麻疹；|e@乙肝疫苗可预防乙肝；|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '6', '母乳喂养对婴儿的生长发育有什么好处？', 'a@母乳营养全面、易于消化吸收；|b@经济；|c@母乳含有抗体，增强婴儿的抗病能力；|d@方便；|e@温度适宜、清洁；|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '7', '食用盐加碘的好处是：', 'a@预防缺碘性甲状腺肿（俗称大脖子病）|b@预防胎儿或儿童发育不良；|c@满足人体的生长、发育需要；|d@预防儿童智力低下;|e@预防高血压；|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '8', '发现有人煤气中毒时，首先应该怎样处理？', 'a@给中毒者喝水|b@打开门窗通风|c@尽快将中毒者转移到空气新鲜、通风良好的地方，并关闭燃气总开关|d@服用抗生素|e@将煤气中毒者抬到凉的地方降温并灌醋|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '9', '乙肝和艾滋病的共同的传播途径有哪些？', 'a@日常生活接触|b@血液传播|c@共用卫生间|d@性接触传播|e@共用剃须刀、牙刷|f@母婴传播|g@共用劳动工具|h@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '10', '共用毛巾可传播的疾病有：', 'a@皮肤病|b@性传播疾病|c@红眼病、沙眼|d@口腔溃疡|e@牙痛|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '11', '为避免发生农药中毒，请指出下面正确的说法：', 'a@配置药液和拌种时要戴防护手套|b@如果药液滴在衣服上需要更换衣服|c@夏天喷洒农药最好选择下午2～3点钟|d@喷洒农药过程中不能喝水、吸烟|e@多余的农药可倒在水沟里|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '12', '流感病毒通过哪些途径传播？', 'a@咳嗽、打喷嚏、说话时产生的飞沫|b@被流感病毒污染的手|c@被流感病毒污染的茶具、食具、毛巾|d@不洁的生水|e@不洁的食物|f@与病人的直接接触|g@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '13', '职业性健康检查包括', 'a@上岗前体检|b@在岗期间定期体检|c@离岗健康检查|d@应急健康检查|e@孕期健康检查|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '14', '严重缺碘会造成哪些疾病？', 'a@生长发育不良|b@呆小症|c@孕妇流产|d@高血压|e@糖尿病|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '15', '人被狗、猫咬伤后，应采取以下哪些措施：', 'a@立即用肥皂水或清水彻底冲洗伤口至少15分钟|b@立即用口将血水吮吸出来|c@用2%～3%的碘酒或75%的酒精涂擦消毒伤口|d@注射狂犬病疫苗或同时注射抗狂犬病血清|e@坚持按时接种5针狂犬疫苗|f@接种三针以后无症状，可停止接种疫苗|g@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '16', '超重和肥胖是下列哪些疾病患病率增加的主要原因之一？', 'a@心脑血管病|b@糖尿病|c@甲亢|d@脂肪肝|e@痛风|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '17', '什么样的定型包装食品不要购买？', 'a@超过保质期|b@无厂家名称、地址|c@无生产日期|d@胀袋食品|e@无食品批准文号|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '18', '蚊子、苍蝇、老鼠、蟑螂可以传播多种疾病，您认为防制的综合措施有哪些？ ', 'a@净化环境；|b@消除和控制孳生地；|c@直接诱杀；|d@使用农药直接喷杀；|e@换地方居住；|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '19', '购买和使用农药的时候，您认为下列哪些做法是正确的？', 'a@购买农药时，可以和日常用品放在一个袋子(或篮子)里|b@农药放在远离小孩的地方|c@农药可以凭经验使用|d@误食农药，发生中毒，最先应该做的是催吐|e@农药不能放在厨房|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '20', '有人在您面前吸烟时，您正确的做法？', 'a@听之任之|b@自己躲开|c@开窗通风|d@劝阻吸烟者|e@和他人一起吸烟|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '21', '为了对社会家庭个人负责，如何有效预防道路交通伤害？', 'a@开车（或者乘车）时，一定要按照交通法规的规定系好安全带或戴好头盔|b@不超速驾驶、不疲劳驾驶、不酒后驾车。|c@骑摩托车必须戴头盔。|" +
				"d@行人和非机动车驾驶员遵守道路交通法规，过马路时走横道线，做到红灯停绿灯行。|e@开车时，可以随时接听电话。|f@车流少的时候，超速没关系。|g@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '22', '为避免药物成瘾，服用镇静催眠药和镇痛药时应注意哪些？', 'a@在医生指导下进行，千万不要自行服用；|b@症状好转后应逐步减量；|c@服用催眠药应采用最小剂量，失眠症改善后应停止服用；|d@当发现对某一种药物产生一定依赖时，应在医生指导下逐步减少或逐步更换其他药物；|e@多种药物一起服用|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '23', '如果发现病死的家禽、鸟，您会怎么办？', 'a@向畜牧部门报告|b@拿回家煮熟后食用|c@按照畜牧部门的要求深埋处理|d@不管，当作没看见|e@喂其他动物|f@扔到河里去|g@烧掉|h@卖掉|i@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '24', '遇到有人呼吸、心跳骤停的情况，您会立即采取哪些措施？', 'a@人工呼吸|b@胸外心脏按压|c@吃速效救心丸|d@掐人中|e@用力摇晃患者，使其苏醒|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '25', '您认为出现下列哪些情况有可能是癌症的报警信号：', 'a@异常肿块|b@异常出血|c@原因不明的发热、乏力、进行性体重减轻|d@不明原因的发胖|e@嗜睡|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '26', '您认为水源受到污染会引起下列哪些疾病？', 'a@霍乱|b@水俣病|c@甲肝|d@乙肝|e@血吸虫病|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '27', '预防儿童溺水应该注意哪些？', 'a@儿童少年不要单独下水游泳|b@不到情况不明的水域游泳|c@游泳时不要打闹，不要在天然水域练习跳水|d@下水前要做好准备活动|e@在冬季，儿童应避免在冰上行走、滑冰或在薄冰上骑车|f@不知道', '3', '4');");
		db.execSQL(basicSql
				+ " values('1', '28', '我国农村推广使用的无害化卫生厕所是下列哪种形式？', 'a@三格化粪池式厕所|b@双瓮式厕所|c@双坑交替式厕所|d@简易化粪池|e@沼气池式厕所|f@粪便分集式生态厕所|g@不知道', '3', '4');");
		

		//个人生活方式与行为测试
		db.execSQL(basicSql
				+ " values('1', '1', '您一般什么时候刷牙？', '1@早晨刷|2@晚上刷|3@早晚都刷|4@很少刷', '4', '3');");
		db.execSQL(basicSql
				+ " values('1', '2', '您是否能做到每年进行一次健康体检?', '1@能|2@不能', '4', '3');");
		db.execSQL(basicSql
				+ " values('1', '3', '当您需要紧急医疗救助时，应拨打：', '1@120|2@119|3@122|4@不知道', '4', '3');");
		db.execSQL(basicSql
				+ " values('1', '4', '成年女性一天饮用酒的酒精量不能超过：', '1@25克|2@50克|3@100克|4@15克|5@自己的酒量|6@不知道', '4', '3');");
		db.execSQL(basicSql
				+ " values('1', '5', '为了预防高血压，一般成年人每天吃盐不能超过多少克？', '1@2克 |2@6克|3@9克|4@12克|5@不知道', '4', '3');");
		db.execSQL(basicSql
				+ " values('1', '6', '为了去除残留农药和污染物，蔬菜水果清洗后，至少要用清水浸泡几分钟？', '1@10分钟|2@15分钟|3@5分钟|4@不知道', '4', '3');");
		db.execSQL(basicSql
				+ " values('1', '7', '发生火灾时，应该：（多选题）', 'a@用湿毛巾捂住口鼻|b@俯伏撤离火场|c@立即拨打119|d@乘坐电梯尽快逃离|e@穿好衣服，带上贵重物品，尽快逃离|f@不知道', '4', '4');");
		db.execSQL(basicSql
				+ " values('1', '8', '在日常生活中注意养成自觉保护环境的良好习惯要做到哪些要求？（5点）$$$$$', '', '4', '1');");*/
	}

	private void initQuestionInstance(SQLiteDatabase db) {
		db.execSQL(DBConfigs.CREATE_TABLE_QUESTION_ANSWER);
	}

	// 一般在实际项目中是不能这样做的，正确的做法是在更新数据库表结构时，还要考虑用户存放于数据库中的数据不会丢失,从版本几更新到版本几。  
	@Override
	public void onUpgrade(SQLiteDatabase db, int arg1, int arg2) {

	}

}